       identification division.
       program-id. Program1.

       environment division.
       configuration section.

       data division.
       working-storage section.
       01 N PIC 9(5).
      *PIC 9(5).
      *N PIC 9(5).
      *Highest number is 99999.
     
       procedure division.
      * Next step: Find out how to define a numeric variable.
           display 'Hello world'.
           STOP run.
           goback.

       end program Program1.