       program-id. Program1 as "Cobol01.Program1".

       data division.
       working-storage section.

       procedure division.
       
           display 'Hello, Cobol'.
           stop ' '.
           stop run.
           goback.
           
       end program Program1.
