       identification division.
       program-id. Program1.

       environment division.
       input-output section.
       file-control.
           select infile assign inname.
           select outfile assign outname.
       configuration section.

       data division.
       working-storage section.

       procedure division.

           goback.

       end program Program1.